---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
StructuralAsset Methods
StructuralAsset Class See Also Send Feedback
---

The StructuralAsset type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Copy | Produces a copy of the asset. |
|  | Dispose |  |
|  | Equals(Object) | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
|  | Equals(StructuralAsset) | Determines whether this structural asset is equal to another. |
|  | GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object.) |
|  | SetPoissonRatio | Sets the Poisson ratio of the asset. |
|  | SetShearModulus | Sets the shear modulus of the asset. |
|  | SetThermalExpansionCoefficient | Sets the thermal expansion coefficient of the asset. |
|  | SetYoungModulus | Sets the Young's modulus of the asset. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also

StructuralAsset Class

Autodesk.Revit.DB Namespace